{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature report detailing implemented frontend features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend source files for documentation or build reference.",
  "frontend/index.css": "Tailwind base and utility setup with OKLCH color variables and light/dark theme CSS.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app root.",
  "frontend/public/404.html": "Redirect page that routes all unknown paths back to root for SPA behavior.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing, mood pages, and a custom 404 view.",
  "frontend/src/components/chat/ChatMessageBubble.tsx": "Renders chat messages with sender info and text, audio, or video content.",
  "frontend/src/components/chat/ChatThread.tsx": "Chat message list with initial scroll-to-top and staggered slide-up animations.",
  "frontend/src/components/FooterActions.tsx": "Footer buttons triggering placeholder playlist and globe click handlers.",
  "frontend/src/components/GifCarousel.tsx": "Auto-cycling GIF carousel with fade transitions and indicator controls.",
  "frontend/src/components/OpenWhenGrid.tsx": "Grid of mood cards that navigate via click and display icon and title.",
  "frontend/src/components/PoemReveal.tsx": "Scroll-triggered poem section revealing lines with staggered animations.",
  "frontend/src/data.ts": "Type definitions and mock data for hero GIFs, poems, and mood sections with messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using react-query, updating it when the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, exposing identity state, login, and logout.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom color variables, dark mode settings, and utility animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/LandingPage.tsx": "Renders the birthday landing page with GIF carousel, poem reveal, mood navigation grid, and footer.",
  "frontend/src/pages/MoodPage.tsx": "Displays a themed mood page with header and chat thread; shows a fallback when slug is invalid.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Stores project metadata, goals, features, and architectural notes for the birthday website."
}